Partie 1: Nettoyage des données

In [25]:
# # df['sex_norm']=df['sex']
# df['sex_norm']=df['sex'].replace('male',1).replace('female',0)
# for region in df['region'].unique():
#     # df[f"is_{region}"]=df['region'].replace(f"{region}",1).replace(r'[\w]+',0,regex=True)
#     df[f"is_{region}"]=0
    


# print(df['region'].unique())
# df.head(15)

In [26]:
import pandas as pd
import numpy as np

In [27]:
#Nous chargeons le jeu de données dans un dataframe que nous nommons df.

df= pd.read_csv('data/data.csv')

df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [28]:
df.shape
# 1338 lignes et 7 colonnes

(1338, 7)

In [29]:
# verifions le type des variables
df.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [30]:
# verifions les valeurs manquantes

df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [31]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [32]:
#verifions les doublons

df.loc[df[['age','sex','bmi','region','charges']].duplicated(keep=False),:]

     age   sex    bmi  children smoker     region    charges
195   19  male  30.59         0     no  northwest  1639.5631
581   19  male  30.59         0     no  northwest  1639.5631

In [33]:

df.loc[df[['charges']].duplicated(keep=False),:]

# Nous avons un doublon dans notre jeu de données.

     age   sex    bmi  children smoker     region    charges
195   19  male  30.59         0     no  northwest  1639.5631
581   19  male  30.59         0     no  northwest  1639.5631

In [20]:
# suppression du doublon, nous garderons uniquement la première occurence et nous gardons la continuité des index

df_clean = df.drop_duplicates(keep='first',ignore_index=False)

In [35]:
#verification
df_clean.loc[df_clean[['charges']].duplicated(keep=False),:]

Empty DataFrame
Columns: [age, sex, bmi, children, smoker, region, charges]
Index: []

In [36]:
# detection des outliers

df_clean.describe()

               age          bmi     children       charges
count  1337.000000  1337.000000  1337.000000   1337.000000
mean     39.222139    30.663452     1.095737  13279.121487
std      14.044333     6.100468     1.205571  12110.359656
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.290000     0.000000   4746.344000
50%      39.000000    30.400000     1.000000   9386.161300
75%      51.000000    34.700000     2.000000  16657.717450
max      64.000000    53.130000     5.000000  63770.428010